app/controllers/cart_controller.rb

SELECT * FROM `cart_items` WHERE (`cart_items`.`item_id` = '1') AND (`cart_items`.cart_id = 1) LIMIT 1
---
  def add
    item = Item.find params[:id]

SELECT * FROM `cart_items` WHERE (`cart_items`.`item_id` = '1') AND (`cart_items`.cart_id = 2) LIMIT 1
UPDATE `cart_items` SET `quantity` = 11, `updated_at` = '2009-10-26 15:23:59' WHERE `id` = 8
---
  def remove_one
    @item = @cart.cart_items.find_by_item_id params[:id]
    @item.quantity -= 1
    @item.save!

SELECT * FROM `cart_items` WHERE (`cart_items`.`item_id` = '1') AND (`cart_items`.cart_id = 2) LIMIT 1
UPDATE `cart_items` SET `quantity` = -1, `updated_at` = '2009-10-26 15:24:18' WHERE `id` = 8
---
  def add_one
    @item = @cart.cart_items.find_by_item_id params[:id]
    @item.quantity += 1
    @item.save!

SELECT * FROM `cart_items` WHERE (`cart_items`.`item_id` = '1') AND (`cart_items`.cart_id = 2) LIMIT 1
UPDATE `cart_items` SET cart_id = NULL WHERE (cart_id = 2 AND id IN (8))
SELECT * FROM `cart_items` WHERE (`cart_items`.cart_id = 2)
---
  def remove_all
    @item = @cart.cart_items.find_by_item_id params[:id]
    @cart.cart_items.delete @item
    @cart.save!
    if @cart.cart_items.empty?

DELETE FROM `cart_items` WHERE `id` = 3
---
  def clear
    @cart.cart_items.destroy_all