app/controllers/category_controller.rb

  def show
    @category = Category.find params[:id]
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)