app/controllers/item_controller.rb

SELECT * FROM `cart_items` WHERE (`cart_items`.cart_id = 1)
SELECT * FROM `items` WHERE (`items`.category_id = 1)
---
  def show
    @item = Item.find params[:id]