app/controllers/user_controller.rb

UPDATE `carts` SET `user_id` = 1, `updated_at` = '2009-10-26 10:40:59' WHERE `id` = 2
UPDATE `users` SET `login_count` = 1, `last_login` = '2009-10-26 10:39:32', `updated_at` = '2009-10-26 10:39:32' WHERE `id` = 1
---
  def login
    if request.post?
      user = User.authenticate(params[:user][:login], params[:user][:password])
      if user
        user.login_count = user.login_count + 1
        user.last_login = DateTime.now
        if !user.cart and @cart # We have a floating cart => attach it to the user
          user.cart = @cart
          add_debug "Cart reattached to user"
        end
        user.save!  # Do not validate user, because it has no password at this point

INSERT INTO `users` (`login`, `password_hash`, `password_salt`, `first_name`, `last_name`, `email`, `login_count`, `last_login`, `created_at`, `updated_at`) VALUES('torr', '0dda38e2d85f2fb8bf357972a2478d20b5e7d96d', 'KXyibn6aNV', 'Mister', 'Donut', 'a@b.com', NULL, NULL, '2009-10-21 10:10:14', '2009-10-21 10:10:14')
---
  def register
    @title = "Registration"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      if @user.save